from locust import HttpUser, TaskSet, task, between
import random


class HelloWorldUser(HttpUser):
    wait_time = between(5, 15)

    @task
    def predict(self):
        stories = [
            """ฉันชื่อแพรวพรรณ ฉันอายุ 17 ปี และกำลังศึกษาอยู่ในโรงเรียนมัธยมศึกษาตอนปลาย ฉันชอบเล่นกีฬาและรักการเรียนรู้
            ฉันไม่เคยคิดว่าฉันจะถูกปฏิเสธ แต่เมื่อฉันพบกับเขาคนแรกในโรงเรียน
            ฉันก็เลยต้องซ่อนความรู้สึกของฉันเพราะไม่กลัวจะถูกปฏิเสธ ฉันพยายามที่จะไม่แสดงความรู้สึกของฉัน แต่เขาก็มีความรู้สึกเหมือนกัน
            และเราก็มีเรื่องราวใหม่ๆ กัน
            """,
            """
            เมื่อไหร่ฉันจะได้พบกับคุณ (When Will I See You Again?) - นักเรียนชายที่รักนักเรียนสาว แต่ต้องย้ายไปอยู่ต่างเมือง
            """,
            """
            ฉันอยากเป็นเธอ (I Want to Be You) - นักเรียนชายที่รู้สึกดึงดูดจากเพื่อนของเขาและต้องหาวิธีแสดงความรู้สึกของเขา
            """,
            """
            Gojo ชนะรึยัง???
            """,
            """
            บางครั้งคนเราจะรู้สึกว่า
            แมวมีโลกส่วนตัวของพวกมันเองสูงมาก
            พวกมันวิ่งไปทั่วบ้านราวกับเป็นเจ้าของบ้าน
            สื่อสารกับคนเราด้วยสัญญาณที่ละเอียดอ่อน
            และไม่ชอบเลยเวลาที่คนเราปิดประตู
            """,
        ]

        rand_text = random.choice(stories)
        # host = 'http://localhost:8080/predict'
        host = 'https://ellabert-image-776241027088.asia-southeast1.run.app/predict'

        self.client.post(host, headers={'Content-Type': 'application/json'},json={
            'text': rand_text}
        )
